## Prueba #0203

In [1]:
import pandas as pd
import numpy as np
import os

#### Leer los datos.

In [2]:
# Ir al directorio en el que se encuentra el archivo. 
os.chdir(r'./')                # Reemplazar por la ruta correcta.

In [3]:
df = pd.read_csv('data_sales.csv', header='infer')

In [4]:
df.shape

(43, 5)

In [5]:
df.head(5)

          Date   Region     Item  UnitPrice  Units
0   4-Jul-2014     East  Pen Set       4.99     62
1  12-Jul-2014     East   Binder       1.99     29
2  21-Jul-2014  Central  Pen Set      12.49     55
3  29-Jul-2014     East   Binder      19.99     81
4   7-Aug-2014  Central  Pen Set      23.95     42

#### Responda las siguientes cuestiones.

1). Añada una nueva variable $Amount = UnitPric \times Units$.

In [6]:
df['Amount'] = df.UnitPrice * df.Units
df.head(5)

          Date   Region     Item  UnitPrice  Units   Amount
0   4-Jul-2014     East  Pen Set       4.99     62   309.38
1  12-Jul-2014     East   Binder       1.99     29    57.71
2  21-Jul-2014  Central  Pen Set      12.49     55   686.95
3  29-Jul-2014     East   Binder      19.99     81  1619.19
4   7-Aug-2014  Central  Pen Set      23.95     42  1005.90

2). Precio unitario medio de cada región. Use el método groupby().

In [8]:
df.groupby('Region').agg({'UnitPrice': ['mean']})

         UnitPrice
              mean
Region
Central  18.018750
East      9.143846
West     53.658333

3). Precio unitario medio de cada región. Use el método pivot_table().

In [12]:
df.pivot_table(values=['UnitPrice'], aggfunc={'UnitPrice': np.mean}, index=['Region'])

         UnitPrice
Region
Central  18.018750
East      9.143846
West     53.658333

4). Precio unitario promedio y unidades para cada región en una sentencia de código. Use el método groupby().

In [24]:
#En este ejercicio no se si se refiere al promedio o al sum en el caso de las unidades, solo sería cambiarlo por sum
df.groupby('Region').agg({'UnitPrice': ['mean'], 'Units': ['mean']})

         UnitPrice      Units
              mean       mean
Region
Central  18.018750  49.958333
East      9.143846  53.153846
West     53.658333  38.500000

5). Promedio del precio unitario y de las unidades para cada región en una sentencia de código. Use el método pivot_table().

In [23]:
#En este ejercicio no se si se refiere al promedio o al sum en el caso de las unidades, solo sería cambiarlo por sum
df.pivot_table(values=['UnitPrice', 'Units'], aggfunc={'UnitPrice': np.mean, 'Units': np.mean}, index=['Region'])

         UnitPrice      Units
Region
Central  18.018750  49.958333
East      9.143846  53.153846
West     53.658333  38.500000

6). Unidades totales para cada región y tipo de artículo en una sentencia de código. Use el método pivot_table(). Rellene los valores faltantes con 0.

In [28]:
df.pivot_table(values=['Units'], aggfunc={'Units': np.sum}, index=['Region','Item'], fill_value=0)

                 Units
Region  Item
Central Binder     424
        Desk         7
        Pen         27
        Pen Set    243
        Pencil     498
East    Binder     234
        Pen        175
        Pen Set    152
        Pencil     130
West    Binder      64
        Desk         3
        Pen         76
        Pencil      88

7). Cantidad total de ventas para cada región y tipo de artículo en una sentencia de código. Use el método pivot_table(). Rellene los valores faltantes con 0.

In [29]:
df.pivot_table(values=['Amount'], aggfunc={'Amount': np.sum}, index=['Region','Item'], fill_value=0)

                  Amount
Region  Item
Central Binder   5762.63
        Desk      875.00
        Pen       539.73
        Pen Set  2421.39
        Pencil   1540.32
East    Binder   2535.66
        Pen      1354.25
        Pen Set  1748.48
        Pencil    363.70
West    Binder   1279.36
        Desk      825.00
        Pen       151.24
        Pencil    231.12